[{"url":"https://gloucester.gov.uk/about/councillors.html","title":"Find your councillors | About | Gloucester City Council","text":"## Your local councillors represent you at the council Councillors make decisions about council services, represent your views, and help resolve local issues. Enter your postcode below to find out who represents your area. ### What do councillors do? Councillors represent you and your community at the council. They: * Make decisions on council services and policies * Represent your views and concerns * Help resolve issues in your local area * Work with local groups and organizations ### How to contact your councillor You can contact your councillor about: * Local issues and concerns * Council services * Planning applications * Community matters **Tip:** For routine council services (like bin collections or council tax), it's usually quicker to [contact the council directly](https://gloucester.gov.uk/contact)."},{"url":"https://gloucester.gov.uk/bins/assisted-collections.html","title":"Assisted Collections | Bins and Recycling | Gloucester City Council","text":"We may be able to provide a free assisted collection service if you need help to take your waste and recycling containers to the pavement because of mobility difficulties or an impairment and there is no one else in your household. ### 🔄 Assisted collection review **If you have received a review letter, we are aware that some residents didn't receive the form.** If you would like to continue with your assisted collection please email your collection address to [environment@gloucester.gov.uk](mailto:environment@gloucester.gov.uk) You do not need to complete the form on this page. ## Who is eligible ### ✓ You may be eligible if: * You have mobility difficulties or an impairment that prevents you from taking bins to the pavement * There is no one else in your household who can help * You live in a property with individual bins (not communal bin stores) ### ✕ This service is not available to: * Residents that use communal bin stores * The original person who applied for an assisted collection and is no longer living at the property * Residents that have restricted access for example caravan parks, narrow or private roads, steps or steep driveways, length of driveway or locked gates **Important:** If you are receiving assisted collections but no longer need the service, you must inform us as soon as possible. ## How to apply or cancel an assisted collection ### Apply online (quickest way) Online is the quickest way to apply or cancel an assisted collection. [Apply or cancel online →](https://www.gloucester.gov.uk/environment-waste-recycling/waste-recycling-street-cleaning/bins-recycling/assisted-collections/) ### 📞 Other ways to apply or cancel Please phone us on **[01452 396 396](tel:+441452396396)** if you cannot use the online service. ## Important information ### 📋 Proof of eligibility We may ask for proof of eligibility and we reserve the right to suspend or withdraw this service at any time although we would notify you if the service was to be withdrawn."},{"url":"https://gloucester.gov.uk/bins/collection-day.html","title":"Check your bin collection day | Bins and Recycling | Gloucester City Council","text":"Enter your postcode to find out which bins are collected when at your property. ## How to put your bins out **By 7am on collection day** Put bins out the evening before — collections can start early **At the boundary of your property** Where your drive meets the pavement, or at your garden gate **Where crew can reach them** Crews cannot enter your property or open gates **Lid must close fully** Overfilled bins may not be collected **Bring back within 24 hours** Don't leave bins on the pavement after collection ## What if my bin isn't collected? **Check it wasn't refused** Was the lid closed? Was it in the right place? Wrong items inside? **Check for service updates** Bad weather or vehicle breakdowns can delay collections **Give crews until end of day** Crews can be out until 5pm, so your bin may still be collected **Report by 4pm the next business day** If still not collected, [report a missed collection](https://gloucester.gov.uk/bins/missed-collection.html) by 4pm the next business day and we'll return within 2 working days **⚡ We'll return within 2 working days** after you report a missed collection. ## Set up reminders After looking up your collection days above, you can: * **Add dates to your calendar** — Subscribe to an automatically updating calendar feed * **Email or SMS reminders** — Get notified the evening before each collection * **Download PDF** — Keep a copy of your collection schedule 💡 **Tip:** Look up your postcode above to see reminder options for your address."},{"url":"https://gloucester.gov.uk/bins/extra-or-larger-bin.html","title":"Apply or Renew an Extra or Larger Black Bin | Bins and Recycling | Gloucester City Council","text":"You can get an extra or larger black bin if you're recycling everything you can by making full use of the recycling containers and if any of the following apply to you. ## Who is eligible ### ✓ You may be eligible if: * **7 or more residents** registered at the property * **2 or more children under the age of 3** and still wearing nappies Have you heard about the [Gloucestershire Real Nappy Project](https://www.gloucester.gov.uk/media/vlqbs2ce/gloucestershire-real-nappy-project.pdf) (PDF, 8.3 MB) * **Certain medical conditions** that generate additional waste ### ⚠️ Important: Before you apply **If you're having problems managing your waste and don't meet the criteria, please ensure you are making full use of the weekly recycling service.** For us to assess your application you must be recycling your waste by having a minimum of: * 2 recycling boxes * 1 blue sack * 1 large food caddy * 1 small food caddy Use our [order recycling container service](https://gloucester.gov.uk/bins/order-recycling-containers) to order boxes, lids, sacks and food caddies. ### 📸 Photo evidence required You'll need to provide photos of your recycling on your recent collection day (remove lids so recycling can clearly be seen). ## How to apply or renew ### Apply online (quickest way) Online is the quickest way to apply or renew for an extra or larger black bin. [Apply or renew online →](https://www.gloucester.gov.uk/environment-waste-recycling/waste-recycling-street-cleaning/bins-recycling/apply-or-renew-an-extra-or-larger-black-bin/) ### 📞 Other ways to apply or renew Please phone us on **[01452 396 396](tel:+441452396396)** if you cannot use the online service. ## What happens next\n\n### ⏰ Decision timeline We aim to provide you with a decision or correspondence within **6 weeks**. We may contact you for more information or a site visit may be required. **Until a decision is made it is your responsibility to manage your extra waste.** ### 💡 Need help reducing waste? Most households can manage with a standard black bin by making full use of the recycling service. Check our [recycling guide](https://gloucester.gov.uk/bins/what-goes-where.html) to see what you can recycle. For families with young children, consider the [Real Nappy Project](https://www.gloucester.gov.uk/media/vlqbs2ce/gloucestershire-real-nappy-project.pdf) which can help reduce nappy waste significantly."},{"url":"https://gloucester.gov.uk/bins/garden-waste.html","title":"Garden waste collection | Bins and Recycling | Gloucester City Council","text":"Subscribe to fortnightly garden waste collection in a brown bin. We collect from February to November every year. ## Annual subscription £60 per year 📅 February to November (10 months) 🗓️ That's about £6 per month during the collection season ## What you get 🗓️ ### Fortnightly collections Regular collections every two weeks from February to November 🗑️ ### Brown bin provided 240-litre bin delivered free if you don't have one 📍 ### Same day as black bin Collected on alternate weeks to your general waste ⏰ ### Collection window Collected between 7am and 6pm on your scheduled day ❄️ ### Winter break included No collections in December and January when waste is minimal ### 📌 Important to know **The garden waste service runs annually from 1 February to 30 November.** The subscription is £60 per season, and you can join at any time. Your collections will continue until the season ends on 30 November, then you can renew for the next season starting 1 February. ## How it works 1. **Subscribe online** — Pay £60 by card or Direct Debit 2. **Receive confirmation** — We'll email you within 2 working days 3. **Get your brown bin** — Delivered within 10 working days 4. **Put it out for collection** — Same day as your black bin 5. **We collect it** — Every two weeks, February to November 6. **Renew next year** — We'll send you a reminder ## What we collect ### ✓ You can put in your brown bin * Grass cuttings * Lawn clippings * Leaves * Small branches (under 10cm) * Twigs * Hedge trimmings * Plants & flowers * Weeds * Windfall fruit * Dead flower heads\n\n### ✕ Do not put in your brown bin * Soil or turf * Tree stumps or large branches * Japanese knotweed (invasive species) * Diseased plants (put in black bin to prevent spread) * Pet waste * Food waste (use your food caddy instead) * Plant pots, stones or gravel ### 🏢 Don't have a garden? You don't need to subscribe to this service. Use your food caddy for food waste and put houseplant cuttings in your black bin. ## Collection dates ### 📅 2025 season **Collections run:** 1 February 2025 to 30 November 2025 **Winter break:** December 2025 and January 2026 (no collections) **2026 season starts:** 1 February 2026 We don't collect in December and January because there's very little garden waste in winter. This also gives crews time for vehicle maintenance and helps reduce costs. **Your collection day:** Brown bin collection is on the same day as your black bin, but in alternate weeks. [Check your collection day →](https://gloucester.gov.uk/bins/collection-day.html) ## 💡 Composting at home You can reduce garden waste and create free compost by composting at home. It's better for your garden and the environment. * **Free** — No subscription needed * **Good for your garden** — Creates natural fertilizer * **Better for the environment** — No transport needed * **Easy to get started** — Simple once you know how [Guide to composting at home →](https://gloucester.gov.uk/bins/composting-at-home) ## Common questions ### Can I have more than one brown bin? Yes. You pay £60 for each additional bin. Subscribe for your first bin, then [order extra bins](https://gloucester.gov.uk/bins/order-bin) separately.\n\n### What if I only want it for part of the year? The subscription covers the full season from 1 February to 30 November. We don't offer part-season subscriptions or refunds if you decide to cancel partway through. Consider whether you'll use the service for most of the season before subscribing. ### What if I move house? If you move within Gloucester, you'll need to take out a new subscription for your new address. The subscription is tied to the property, not to you personally. If you move outside Gloucester, the subscription cannot be transferred or refunded. ### What happens to my garden waste? It's taken to a composting facility where it's turned into soil conditioner used by farmers and gardeners. ### What if my bin isn't collected? Wait until the next working day (crews sometimes run late), then [report a missed collection](https://gloucester.gov.uk/bins/missed-collection.html). We'll return within 2 working days. ### Can I put garden waste in my black bin instead? You can, but your black bin is only collected every two weeks and may fill up quickly. Garden waste can also be composted at home for free."},{"url":"https://gloucester.gov.uk/bins/","title":"Bins and Recycling | Gloucester City Council","text":"## Browse all bin services Can't find what you need above? Browse the full A-Z list of bin and recycling services. * [→ Assisted collections](https://gloucester.gov.uk/bins/assisted-collections.html) * [→ Check your bin day](https://gloucester.gov.uk/bins/collection-day.html) * [→ Extra or larger black bin](https://gloucester.gov.uk/bins/extra-or-larger-bin.html) * [→ Garden waste subscription](https://gloucester.gov.uk/bins/garden-waste.html) * [→ Missed collection](https://gloucester.gov.uk/bins/missed-collection.html) * [→ Order bins & containers](https://gloucester.gov.uk/bins/order-bins.html) * [→ Recycling centres](https://gloucester.gov.uk/bins/recycling-centres.html) * [→ What goes in which bin](https://gloucester.gov.uk/bins/what-goes-where.html) **💡 Not sure about a specific item?** Use the [Gloucestershire Waste Wizard](https://www.gloucestershirerecycles.com/waste-wizard/) to search for any item and find out how to dispose of it. ## Need help? If you cannot complete something online, you can get help in other ways: * Phone: [01452 396396](tel:+441452396396) * Email: [heretohelp@gloucester.gov.uk](mailto:heretohelp@gloucester.gov.uk) * Visit: Eastgate Management Suite, Eastgate Street, Gloucester GL1 1PA"},{"url":"https://gloucester.gov.uk/bins/missed-collection.html","title":"Report a missed collection | Bins and Recycling | Gloucester City Council","text":"We'll return within 2 working days to collect your bin. This service is quick and easy — most people complete it in under 2 minutes. **All collections running normally** There are no reported issues affecting collections today. ## Before you report a missed collection **You can report a missed collection if:** * Your bin was due for collection today or yesterday * It's before 4pm on the day after your collection * You put your bin out by 7am on collection day * Your bin was at the edge of your property (where the crew could reach it) * The lid was closed and nothing was sticking out * You didn't have wrong items in your bin (this causes it to be refused) **⏰ Reporting deadline: 4pm the next business day** Crews update the system as they complete rounds. You can report a missed collection until 4pm the day after your scheduled collection. After that, you'll need to wait for your next scheduled collection. ### Your address Postcode We'll use this to find your address and collection schedule ### Which bins weren't collected? Select all that apply. You can report multiple bins at once. Loading your bins... ### A bit more detail Is there anything else we should know? (optional) This helps us resolve the issue faster. You don't need to explain where you put your bin — we already know that. How would you like us to contact you? ## Report received Your reference number is: MB-2025-XXXXX ### What happens next **We'll return within 2 working days** (usually sooner) to collect your bin. Please leave your bin out until it's been collected. If we can't collect your bin (for example, if it contains wrong items), we'll let you know why. ## What if your bin was refused? If your bin has a note or sticker on it, it wasn't collected for one of these reasons: ❌\n\n### Wrong items inside Contaminated bins can't be collected. Check what should go in each bin. [What goes where →](https://gloucester.gov.uk/bins/what-goes-where.html) ⚠️ ### Lid wouldn't close Overfilled bins or items sticking out prevent safe collection. 🚫 ### Not accessible Bins behind locked gates or too far from the road can't be reached. ⚖️ ### Too heavy Bins that are too heavy create a safety risk for collection crews. **What to do next:** Remove the problem items, then put your bin out on your next scheduled collection day. ## How to prevent missed collections 🌙 **Put bins out the night before** Collections can start as early as 7am — don't risk missing your slot. 📍 **Place at the edge of your property** Position bins where your drive meets the pavement or road. ✓ **Make sure the lid closes** Don't overfill or force items in — lids must close fully. 🚪 **Keep it accessible** Crews cannot open gates or enter your property. ♻️ 🔔"},{"url":"https://gloucester.gov.uk/bins/order-bins.html","title":"All Your Bins & Containers | Bins and Recycling | Gloucester City Council","text":"* **🆕 New to Gloucester? Get your first bins** All new residents receive a standard black bin for general waste. You'll need to order your free recycling containers separately. [Order your recycling containers →](https://gloucester-self.achieveservice.com/service/Bins___Order_recycling_containers) * **♻️ Order recycling containers** Free green boxes, blue sacks, and food caddies for all Gloucester residents. Each household should have a minimum of 2 green boxes and 1 blue sack. ##### Green boxes (2 minimum) For plastics, metals, and glass. Collected weekly. ##### Blue sacks For paper and cardboard. Can have multiple. ##### Food caddies Large outdoor caddy and small kitchen caddy. [Order recycling containers online →](https://gloucester-self.achieveservice.com/service/Bins___Order_recycling_containers) #### 📍 Replacement lids for green boxes Collect free replacement lids from our depot at 81 Eastern Avenue, Gloucester, GL4 6PG, or from Quedgeley Town Council. You cannot collect other containers from the depot. * **🗑️ Order or replace a black bin** If your black bin is damaged, stolen, or you need a replacement refuse sack, contact us by phone or online form. Phone: **[01452 396 396](tel:+441452396396)** Or use the [Contact us form](https://gloucester.gov.uk/bins/contact) * **📏 Extra or larger black bin** Need more waste capacity? You may be eligible if you have 7+ residents, 2+ children in nappies, or certain medical conditions. [Check eligibility and apply →](https://gloucester.gov.uk/bins/extra-or-larger-bin.html) * **🤝 Assisted collections** Free service if you have mobility difficulties and cannot take bins to the pavement, with no one else in your household to help. [Apply for assisted collections →](https://gloucester.gov.uk/bins/assisted-collections.html)\n\n### 🏢 Flats & Shared Properties If you live in a flat or apartment, you'll likely have communal bins instead of individual containers. #### What you'll have * **Communal bins:** Shared recycling and waste bins in a designated bin store * **Food caddy:** Each flat gets a 7L kitchen caddy for food waste * **Communal food bin:** A brown 140L bin in the bin store for all residents #### Collection schedule for flats **Food waste:** Weekly collection **Recycling and general waste:** Fortnightly on alternating weeks #### Bin sizes for flats The number and size of bins depends on how many flats share them: * For every 8 flats: One 1100L communal bin * Recycling bins: 240L or 360L depending on the development #### Problems with communal bins? If your communal bins are: * Always full or overflowing * Damaged or need replacing * Not being collected properly [Call us: 01452 396 396](tel:+441452396396) ### 🏗️ Developers & New Builds Information for developers, builders, and residents moving into new build properties. #### When will new properties get bins? Before bins can be delivered to new residential properties: * The property must be registered for Council Tax * The developer must request a site visit from our contractor * The contractor needs to agree that collections can be carried out safely #### 📋 Planning & storage guidance for developers ▼ ##### Bin store requirements Developers must consider bin storage as part of planning submissions: * Collections can only be made from designated bin stores with adequate access * Under Building Regulations (2010) Part H: Householders must not carry waste containers further than 30m * Bin stores must be accessible for collection vehicles\n\n##### Storage space calculations **For individual houses:** * 1 x 180L black bin (collected fortnightly) * 2 x green boxes for recycling * 1 x blue sack * 1 x outdoor food caddy **For flats/multiple occupancy:** * 1 x 1100L bin per 8 flats * 240L or 360L recycling bins as appropriate * 1 x 140L communal food waste bin per bin store ##### Contact for developers For full waste storage and collection guidance, download the [Waste & Recycling Storage Guidance (PDF)](https://www.gloucester.gov.uk/media/trqgrqer/waste-storage-and-collection-guidance-february-2020.pdf) To arrange a site visit: **[01452 396 396](tel:+441452396396)**"},{"url":"https://gloucester.gov.uk/bins/recycling-centres.html","title":"Household Recycling Centres | Bins and Recycling | Gloucester City Council","text":"Household Recycling Centres (HRCs), sometimes called 'tips' or 'the dump', are for items that don't fit in your bins. All centres require you to book before visiting. ### 📅 Booking required for all visits **You must book before visiting any Household Recycling Centre.** Book online at [Book your HRC visit](https://www.gloucestershirerecycles.com/household-recycling-centres-hrcs/car-and-van-bookings-for-hrc-visits/) Phone bookings: **01452 596 626** (weekdays 9am-5pm) for those without internet access ### 🏭 Your nearest centre ### Hempsted HRC (Gloucester) #### 📍 Location Hempsted Lane, Gloucester #### 🕐 Opening hours **Summer:** 9am - 5pm **Winter:** 10am - 4pm **Closed:** Thursdays **Note:** Closed on Christmas Day, Boxing Day and New Year's Day ## All Gloucestershire Recycling Centres You can visit any of the five Household Recycling Centres in Gloucestershire. ### Fosse Cross HRC (Cirencester) #### 📍 Location Fosse Cross, Cirencester #### 🕐 Opening hours **Summer:** 9am - 5pm **Winter:** 10am - 4pm **Closed:** Tuesdays ### Oak Quarry HRC (Coleford) #### 📍 Location Oak Quarry, Coleford #### 🕐 Opening hours **Summer:** 9am - 5pm **Winter:** 10am - 4pm **Closed:** Tuesdays ### Pyke Quarry HRC (Horsley, near Stroud) #### 📍 Location Pyke Quarry, Horsley, near Stroud #### 🕐 Opening hours **Summer:** 9am - 5pm **Winter:** 10am - 4pm **Closed:** Wednesdays ### Wingmoor Farm HRC (Bishops Cleeve)\n\n#### 📍 Location Wingmoor Farm, Bishops Cleeve #### 🕐 Opening hours **Summer:** 9am - 5pm **Winter:** 10am - 4pm **Open:** 7 days a week **Note:** This is the only centre open 7 days a week ## What you can take to recycling centres Household Recycling Centres accept a wide range of materials and items including: Garden waste Cardboard and paper Glass bottles and jars Plastic bottles and containers Metal cans and scrap metal Wood and timber Electrical items Batteries Textiles and clothing Books and media Household furniture Mattresses Fridges and freezers Paint and chemicals Rubble and soil (small amounts) Tyres (limited quantities) **💡 Tip:** For a complete list of what can and cannot be taken, and any restrictions or charges, visit [www.gloucestershirerecycles.com](https://www.gloucestershirerecycles.com/household-recycling-centres-hrcs/) ## Important information ### 🚗 Van permits If you're visiting in a van, pick-up truck, or large vehicle, you may need a permit. Check the Gloucestershire Recycles website for details. ### 🏠 Household waste only Recycling centres are for household waste only. Business and commercial waste is not accepted. ### 📋 What to bring Bring proof of Gloucestershire residency (such as a utility bill or Council Tax letter) and your booking confirmation. ### ⏰ Allow enough time Booking slots are typically 15 minutes. Make sure to arrive on time and allow enough time to unload your vehicle safely."},{"url":"https://gloucester.gov.uk/bins/what-goes-where.html","title":"What goes in which bin | Bins and Recycling | Gloucester City Council","text":"Getting your recycling right helps protect the environment and saves money. Use this guide to know exactly what goes in each bin. 🔍 ### Not sure what goes where? Use the Gloucestershire Waste Wizard to search for specific items and find out exactly how to dispose of them. [Search the Waste Wizard →](https://www.gloucestershirerecycles.com/waste-wizard/) ### ✓ What goes in Plastic bottles Plastic pots & tubs Plastic trays Metal cans & tins Aerosols (empty) Aluminium foil Metal lids ### ✕ Do not put in Plastic bags Polystyrene Plastic film Black plastic trays Crisp packets **💡 Top tips** Rinse items and squash bottles to save space. Remove lids from plastic bottles — metal lids can stay in, plastic lids go in general waste. ### ✓ What goes in Glass bottles Glass jars ### ✕ Do not put in Drinking glasses Pyrex or ovenware Window glass Mirrors Light bulbs Crystal **💡 Top tips** Rinse bottles and jars. You can leave labels on. Remove lids — metal lids go in the other green box, plastic lids go in general waste. ### ✓ What goes in Cardboard boxes Paper & writing paper Newspapers & magazines Envelopes Junk mail Greetings cards Cereal boxes Egg boxes ### ✕ Do not put in Greasy pizza boxes Shredded paper Wallpaper Tissues or kitchen roll Glittery wrapping paper **💡 Top tips** Flatten cardboard boxes to save space. If cardboard is wet or has food on it, put it in your black bin instead. ### ✓ What goes in All cooked food All raw food Plate scrapings Fruit & veg peelings Meat, fish & bones Dairy products Bread & cakes Tea bags & coffee Out of date food\n\n### ✕ Do not put in Any packaging Liquids or oil Pet waste **💡 Top tips** Line your caddy with newspaper or use free compostable bags from the council. Empty weekly to prevent smells. [Get free bags](https://gloucester.gov.uk/bins/compostable-bags) Everything that cannot be recycled. Because it's collected less often, recycle as much as possible to avoid your bin filling up. ### 📝 Common items Nappies Sanitary products Plastic bags Polystyrene Cling film Tissues Crisp packets Pet waste (bagged) **💡 Top tips** Don't leave extra bags beside your bin. Check you're recycling everything possible. [Request an extra bin](https://gloucester.gov.uk/bins/extra-or-larger-bin.html) if you have a larger household. ### ✓ What goes in Grass cuttings Leaves Small branches Hedge trimmings Plants & flowers Windfall fruit ### ✕ Do not put in Soil or turf Tree stumps Japanese knotweed Diseased plants Pet waste Food waste ## Items that need special disposal These items cannot go in any of your bins. Take them to a recycling centre or arrange special collection. ### 🛋️ Bulky waste Furniture, white goods, and mattresses need special collection. [Book a collection →](https://gloucester.gov.uk/bins/bulky-waste)\n\n## Why getting it right matters When you recycle correctly, you're making a real difference to the environment and your community. ♻️ **Creates new products:** Recycled materials become new items instead of going to landfill 💷 **Saves money:** Money saved on waste can be spent on other council services 🌍 **Protects the planet:** Reduces carbon emissions and helps fight climate change 👥 **Creates local jobs:** The recycling industry employs people in our community **⚠️ Contamination wastes everything** When wrong items get mixed into recycling, entire loads can be rejected and sent to landfill. This costs money and wastes everyone's effort. [Learn more about contamination](https://gloucester.gov.uk/bins/contaminated-recycling)"},{"url":"https://gloucester.gov.uk/council-tax/about.html","title":"Understanding Council Tax | Council Tax | Gloucester City Council","text":"Learn how council tax works and what it pays for. ## What is council tax Council tax is a property-based tax charged on homes in England, Scotland, and Wales. Every home is put into a band based on what it was worth on 1 April 1991. The amount you pay depends on which band your property is in and who lives there. Council tax helps pay for local services that benefit everyone in the community. ## What your council tax pays for Your council tax bill includes charges from different organisations. Each one provides different services. ### Gloucester City Council The City Council uses its share to provide local services like: * Waste collection and recycling * Street cleaning * Parks and open spaces * Leisure facilities * Environmental health * Planning and building control * Housing services ### Gloucestershire County Council The County Council gets the largest share and provides services like: * Adult social care * Children's services * Schools and education * Highways and transport * Libraries * Trading standards * Fire and rescue ### Police and Crime Commissioner This part of your bill pays for police services across Gloucestershire. ### Parish or Town Councils Some areas have an extra charge for parish or town councils (like Quedgeley). They provide very local services like: * Community facilities * Local parks and playgrounds * Village halls ## The council tax year Council tax runs for a financial year, from 1 April to 31 March the following year. Your bill shows the full year's charge. You can choose to pay in 10 monthly instalments (April to January) or 12 monthly instalments (April to March). ## The law and council tax ### Legal basis Council tax is set by law under the Local Government Finance Act 1992. This means we must charge council tax on all homes, and people must pay it.\n\n### How charges are set Each year, councils work out how much money they need to provide services. They then set the council tax charge to help cover these costs. The amount is agreed by: * Gloucester City Council (for city services) * Gloucestershire County Council (for county services) * The Police and Crime Commissioner (for police services) * Your parish or town council (if you have one) #### Limits on increases The government sets limits on how much councils can increase council tax each year. If a council wants to increase it by more than the limit, they must hold a local vote (referendum). ## Who sets your band Your property's council tax band is set by the Valuation Office Agency (VOA), which is part of central government. The council does not set bands. Bands are based on what your property was worth on 1 April 1991, not what it's worth now. This is the same for all properties in England. [See all council tax bands](https://gloucester.gov.uk/council-tax/bands.html) ## Who has to pay Council tax is a property tax. The person who lives in the property (or owns it if it's empty) must pay. ### Order of liability If more than one person could be responsible, we use this order to decide: 1. A resident who owns the property (freeholder) 2. A resident who is a leaseholder 3. A resident who is a tenant 4. A resident with a licence to live there 5. Any other resident 6. The owner (if no one lives there) **Example:** If you own and live in your home, you pay. If you rent, you (the tenant) pay, not the landlord. [More about liability when you move](https://gloucester.gov.uk/council-tax/moving.html) ## Exemptions and discounts Some people and properties can get reductions on their council tax.\n\n### Exemptions Some properties are exempt from council tax (no charge at all). For example: * Properties lived in only by full-time students * Properties that cannot legally be lived in * Annexes lived in by elderly or disabled relatives ### Discounts Some situations qualify for a discount. For example: * 25% off if you live alone (single person discount) * Disabled band reduction if you need extra space [See all discounts and exemptions](https://gloucester.gov.uk/council-tax/discounts.html) ## Council Tax Support Council Tax Support is different from discounts and exemptions. It's a benefit that helps people on low incomes pay their council tax. You can get Council Tax Support even if you're working. The amount you get depends on your income, savings, and circumstances. [Find out about Council Tax Support](https://gloucester.gov.uk/council-tax/support.html) ## What happens if you don't pay Council tax is not optional. By law, you must pay it if you're liable. If you don't pay, we have legal powers to collect what you owe. This can include: * Court action to get a liability order * Using enforcement agents (bailiffs) * Taking money from your wages or benefits **Having trouble paying?** Contact us as soon as possible. We can help if you get in touch early. [Get help with payments](https://gloucester.gov.uk/council-tax/help.html) ## Questions about council tax If you have questions about council tax, contact our Revenues team: ### Contact the Revenues team **Phone:** [01452 396396](tel:+441452396396) Monday to Friday, 8:30am to 5pm **Email:** [revenues@gloucester.gov.uk](mailto:revenues@gloucester.gov.uk) **Address:** Gloucester City Revenues and Benefits Eastgate Management Suite Eastgate Street Gloucester GL1 1PA"},{"url":"https://gloucester.gov.uk/council-tax/bands.html","title":"Council Tax Bands and Charges | Council Tax | Gloucester City Council","text":"View council tax charges for each band and check your property's band. ## Council tax charges 2025 to 2026 These are the annual council tax charges for properties in Gloucester for 2025/26. Band Property value (1991) Total annual charge Band A Up to £40,000 £1,492.52 Band B £40,001 to £52,000 £1,741.26 Band C £52,001 to £68,000 £1,990.01 Band D £68,001 to £88,000 £2,238.77 Band E £88,001 to £120,000 £2,736.28 Band F £120,001 to £160,000 £3,233.78 Band G £160,001 to £320,000 £3,731.29 Band H Over £320,000 £4,477.54 **2025/26 increases:** Gloucester City Council increased by 3%, Gloucestershire County Council by 5% (including adult social care), and the Police and Crime Commissioner by 4.5%. The average increase is 4.7%, which is £6.68 per year or £0.13 per week for Band D properties. ## How council tax bands work Properties are put into bands by the Valuation Office Agency (VOA) based on what the property was worth on 1 April 1991. The amount you pay does not change if your property is worth more now. Bands are based on 1991 values. ## Check your property's band You can check which band your property is in on the Valuation Office Agency website. [Check your band on GOV.UK](https://www.gov.uk/council-tax-bands) ## Challenge your band If you think your property is in the wrong band, you can challenge it. You need to contact the Valuation Office Agency, not the council.\n\n### When you can challenge * You've just become the owner or tenant * Your property has changed (for example, been demolished or split into flats) * The area around your property has changed (for example, a new road) * A similar property nearby is in a different band **Important:** You cannot challenge your band just because you think it's too high. Bands are relative to 1991 property values. [Challenge your band](https://www.gov.uk/challenge-council-tax-band) ## How your bill is calculated Your council tax bill is based on: * Your property's band * Whether you get any discounts or exemptions * Whether you qualify for Council Tax Support The standard bill assumes at least 2 adults aged 18 or over live in the property. If fewer adults live there, you may qualify for a discount. [Check if you qualify for a discount](https://gloucester.gov.uk/council-tax/discounts.html)"},{"url":"https://gloucester.gov.uk/council-tax/discounts.html","title":"Discounts and Exemptions | Council Tax | Gloucester City Council","text":"Find out if you can get a discount or exemption on your council tax. You may be able to reduce your council tax bill if: * You live alone or with people who don't count for council tax * Your property is empty or being renovated * You're a student or live with students * You have a disability and need extra space in your home Discounts and exemptions are different from Council Tax Support, which helps people on low incomes pay their bill. ## Apply for a discount or exemption You can apply online through your My Gloucester account. Have your council tax reference number ready. [Apply online](https://gloucester-self.achieveservice.com/) ## Discounts based on who lives in your home ### Single person discount - 25% off **You can get 25% off your council tax if you live alone.** This means you're the only adult (18 or over) living in the property. Children under 18 don't count. #### Who doesn't count as an adult Some people don't count when we work out how many adults live in your home. This includes: * Full-time students * Student nurses * Apprentices and youth trainees * People with a severe mental impairment * People in prison (except for not paying fines) * Care workers (live-in, paid less than £44 a week) * People who are severely disabled and have a carer **Example:** If you live with a full-time student, they don't count, so you can get the single person discount. ### All students living in the property **Full exemption (no council tax to pay)** if everyone in the property is a full-time student. You'll need to provide proof of your student status for everyone living there.\n\n### Disabled band reduction If someone in your home has a disability and you need extra space, you can get your bill reduced to the band below yours. **You can apply if your home has:** * An extra bathroom or kitchen for the disabled person * Extra space inside the property for using a wheelchair * A room (other than a bathroom, kitchen, or toilet) mainly used by the disabled person If you're in Band A (the lowest band), you'll get a reduction based on what Band A properties pay. ## Students and council tax ### Full-time students Full-time students don't have to pay council tax. You're a full-time student if your course: * Lasts at least 1 year * Involves at least 21 hours of study per week **Proof needed:** We need a student certificate from your university or college. You can usually download this from your student portal. ### Student nurses Student nurses on courses leading to registration with a nursing or midwifery council are exempt from council tax. ### If you're studying part-time Part-time students usually have to pay council tax. However, you may qualify for Council Tax Support if you're on a low income. ## Discounts based on your property ### Empty properties **Empty and unfurnished:** You get 1 month with no council tax to pay. After that, you pay the full charge (or more if it's empty for over 2 years). **Empty and being renovated:** Different rules apply depending on the work being done. Contact us for details. ### Annexes If you have an annex (a separate living space that's part of your main home), you may get a discount or exemption. This depends on who lives there and whether it can be rented out separately. ### Second homes There is no discount for second homes. You pay the full council tax charge, even if no one lives there.\n\n### Exempt properties Some properties are exempt from council tax. This includes: * Properties lived in only by full-time students * Properties owned by charities (empty for up to 6 months) * Properties that legally cannot be lived in * Annexes lived in by elderly or disabled relatives ## How to apply You can apply for a discount or exemption online through your My Gloucester account. You'll need: * Your council tax reference number (on your bill) * Proof of your circumstances (for example, a student certificate) * Details of everyone living in your property [Apply now](https://gloucester-self.achieveservice.com/) ## Tell us if your circumstances change You must tell us if your circumstances change. For example: * Someone moves in or out * You finish studying * Your property is no longer empty If you don't tell us, you may have to pay back any discount you weren't entitled to."},{"url":"https://gloucester.gov.uk/council-tax/help.html","title":"Problems Paying Council Tax | Council Tax | Gloucester City Council","text":"Get help if you're struggling to pay your council tax. **Don't wait until you miss a payment.** The earlier you get in touch, the more we can help. We understand that people sometimes have money problems. We're here to help, not judge. [Call us on 01452 396396](tel:+441452396396) ## How we can help If you're having trouble paying, we can: ### Set up a payment arrangement We can agree a payment plan that fits your budget. You'll pay smaller amounts over a longer time. **Important:** You must keep to the agreed plan. If you miss payments, we may have to take further action. ### Check if you qualify for help You might be able to get: * **Council Tax Support** - reduces your bill if you're on a low income * **Discounts** - like the single person discount if you live alone [Check Council Tax Support](https://gloucester.gov.uk/council-tax/support.html) | [Check discounts](https://gloucester.gov.uk/council-tax/discounts.html) ## What to tell us When you contact us, it helps if you can tell us: * Your council tax reference number (on your bill) * Why you're struggling to pay * What you can afford to pay * Your income and essential spending Don't worry if you don't have all this information. Just call us and we'll work through it together. ## What happens if you miss a payment If you miss a payment and don't contact us, we'll send you letters to remind you to pay.\n\n### The stages of enforcement 1. **Reminder notice** - We'll remind you to pay. You usually have 7 days to pay or contact us. 2. **Final notice** - If you still don't pay, you lose the right to pay in instalments. You must pay the full year's bill. 3. **Court summons** - If you still don't pay, we'll apply to the magistrates' court for a liability order. You'll have to pay court costs too. 4. **Liability order** - If the court agrees, we can use enforcement agents (bailiffs) to collect what you owe. **Don't ignore letters from us.** It will only make things worse and cost you more money. Contact us and we'll try to help. ## Enforcement agents (bailiffs) If we have to use enforcement agents, they can: * Visit your home * Take your belongings to sell at auction * Take money from your wages **You'll have to pay extra fees** for the enforcement agents on top of what you already owe. ### What enforcement agents cannot do Enforcement agents must follow strict rules. They cannot: * Force their way into your home * Take things that belong to someone else * Take things you need for work (up to a value of £1,350) * Take things you need for basic living (like your cooker or fridge) * Visit between 9pm and 6am If you think an enforcement agent has broken the rules, contact us immediately. ## Taking money from your wages or benefits ### Attachment of earnings If you're working, we can ask the court to take money directly from your wages. Your employer will deduct the amount and send it to us. ### Deductions from benefits If you receive certain benefits, we can ask the Department for Work and Pensions to take money from your benefits to pay your council tax."},{"url":"https://gloucester.gov.uk/council-tax/","title":"Council Tax | Gloucester City Council","text":"## What is council tax Council Tax is a property-based tax charged on homes. It helps fund important local services provided by Gloucester City Council, Gloucestershire County Council, and the Police and Crime Commissioner. The amount you pay depends on your property's band and who lives there. ### What your council tax pays for * Local services from Gloucester City Council (waste collection, street cleaning, parks, leisure facilities) * County Council services (adult social care, children's services, schools, highways, libraries) * Police and Crime Commissioner for Gloucestershire * Parish or Town Council charges (where you live - for example, Quedgeley) ## Browse all council tax services Can't find what you need above? Browse the full list of council tax services. * [→ Pay your council tax](https://gloucester.gov.uk/council-tax/pay.html) * [→ View your account](https://gloucester.gov.uk/council-tax/your-account.html) * [→ Apply for council tax support](https://gloucester.gov.uk/council-tax/support.html) * [→ Discounts and exemptions](https://gloucester.gov.uk/council-tax/discounts.html) * [→ Moving house](https://gloucester.gov.uk/council-tax/moving.html) * [→ Council tax bands and charges](https://gloucester.gov.uk/council-tax/bands.html) * [→ Problems paying council tax](https://gloucester.gov.uk/council-tax/help.html) * [→ Understanding council tax](https://gloucester.gov.uk/council-tax/about.html) * [→ Second homes and holiday lets](https://gloucester.gov.uk/council-tax/second-homes.html) **💡 Quick tip** Set up Direct Debit to pay your council tax automatically each month. It's the easiest way to make sure you never miss a payment.\n\n## Need help? If you cannot do something online, you can get help in other ways: * Phone: [01452 396396](tel:+441452396396) * Email: [revenues@gloucester.gov.uk](mailto:revenues@gloucester.gov.uk) (for bill questions) or [benefits@gloucester.gov.uk](mailto:benefits@gloucester.gov.uk) (for Council Tax Support) * Visit: Gloucester City Revenues and Benefits, Eastgate Management Suite, Eastgate Street, Gloucester GL1 1PA"},{"url":"https://gloucester.gov.uk/council-tax/moving.html","title":"Moving House | Council Tax | Gloucester City Council","text":"Tell us when you're moving home and update your council tax details. ## Why you need to tell us You must tell us when you move home so we can: * Stop council tax at your old address * Start council tax at your new address * Make sure you pay the right amount * Send your bills to the correct address Tell us as soon as you know your moving date. Don't wait until after you've moved. ## Tell us you're moving Update your address online through your My Gloucester account. You'll need your moving date and new address. [Update your address](https://gloucester-self.achieveservice.com/) ## Who pays council tax when you move ### Moving out You're responsible for council tax at your old address until: * The date you move out, or * The date a new person moves in (whichever comes first) If the property is empty after you leave, you may still have to pay until someone else moves in or the property is sold. ### Moving in You're responsible for council tax at your new address from: * The date you move in, or * The date you become the owner or tenant (whichever comes first) ## If you live with other people If you live with other adults, you're usually all responsible for the council tax bill together. This is called joint liability. **Example:** If you rent a house with 2 friends, all 3 of you are responsible for paying the council tax. We can ask any one of you to pay the full amount. ### Married couples and civil partners If you're married or in a civil partnership and live together, you're both responsible for the council tax bill. This applies even if only one of you is the homeowner or named on the tenancy. ## Moving within Gloucester If you're moving to another property in Gloucester, we'll: * Close your account at your old address * Open a new account at your new address * Send you a new bill If you pay by Direct Debit, we'll update your payments automatically.\n\n## Leaving Gloucester If you're moving out of Gloucester, tell us your: * Moving date * New address (even if it's outside Gloucester) * Forwarding address for any letters We'll send you a final bill showing what you owe up to your moving date. If you've paid too much, we'll refund you. **Moving to a different council:** You'll need to contact your new council to set up council tax at your new address. They may have different charges and payment dates. ## Moving to Gloucester Welcome to Gloucester! When you move here, we'll send you a council tax bill for your new property. ### What you need to do * Tell us your moving date * Register for a My Gloucester account to manage your council tax online * Set up a payment method (we recommend Direct Debit) [Register for My Gloucester](https://gloucester-self.achieveservice.com/) ## Information for landlords As a landlord, you're responsible for council tax if: * Your property is a house in multiple occupation (HMO) * Your property is empty between tenants * Your tenants are all full-time students Tell us when tenants move in or out so we can update our records. ## Final bills and refunds When you move, we'll send you a final bill showing: * What you've paid so far * What you owe up to your moving date * Any refund you're due **Refunds:** If you've paid too much, we'll refund you automatically. This usually takes about 10 working days. **Money owing:** If you still owe money after you move, you must pay this. We'll send you details of how to pay."},{"url":"https://gloucester.gov.uk/council-tax/pay.html","title":"Pay Your Council Tax | Council Tax | Gloucester City Council","text":"Pay your council tax bill online or set up a payment plan. ## Pay now online You can pay your council tax online using a debit card. [Pay online through My Gloucester](https://gloucester-self.achieveservice.com/) You'll need your council tax account reference number, which is on your bill. ## Set up Direct Debit **Direct Debit is the easiest way to pay.** Your payments are taken automatically each month, so you'll never miss a payment. ### Why use Direct Debit * Automatic payments - no need to remember * Never miss a payment * Protected by the Direct Debit Guarantee ### How to set up Direct Debit You can set up a Direct Debit through your My Gloucester account or download a form. [Set up Direct Debit online](https://gloucester-self.achieveservice.com/) ## Payment schedule Council tax is paid over 10 monthly payments from April to January. * ✓ Payments: April to January (10 instalments) * ✓ Payment dates: Usually around the 1st of each month * ✓ No payments in February and March (unless you have a different arrangement) ## Other ways to pay ### 📞 Pay by phone Call **[01452 396396](tel:+441452396396)** Automated payment line available 24 hours a day, 7 days a week. You can pay using a debit card. ### ✉️ Pay by post Make cheques payable to **'Gloucester City Council'** Send to: Gloucester City Revenues and Benefits Eastgate Management Suite Eastgate Street Gloucester GL1 1PA Include your council tax account reference number with your payment."},{"url":"https://gloucester.gov.uk/council-tax/second-homes.html","title":"Second Homes and Holiday Lets | Council Tax | Gloucester City Council","text":"Find out about council tax premiums on second homes and when holiday lets pay business rates instead. ## Second homes premium from April 2025 **From 1 April 2025, furnished properties that are not anyone's main home will pay a 100% council tax premium.** This means you will pay double the standard council tax charge (200% total). Approved by Full Council on 25 January 2024. Effective from 1 April 2025. ## What counts as a second home A second home is a furnished property where there is no resident (no one lives there as their sole or main residence). ### Examples of second homes * A property you own but don't live in as your main home * A furnished property left empty between uses * A property you use occasionally for weekends or holidays * A property let to friends or family at low rates (not commercial letting) ## Holiday lets and business rates Holiday lets occupy a unique position. They can be liable for either council tax OR business rates depending on how much they are used.\n\n### When holiday lets pay business rates instead To pay business rates instead of council tax, your holiday let must meet ALL of these criteria: * **✓ Available for at least 140 days** Available to let commercially for short periods totalling at least 140 days in the previous 12 months AND in the current 12 months * **✓ Actually let for at least 70 days** Actually let commercially for at least 70 days in the previous 12 months (not including your own use) * **✓ Commercial basis** Let on a commercial basis with a view to making a profit at market rates * **✓ Future intention** You intend to make it available for at least 140 days in the following 12 months **Important:** If your holiday let does not meet these criteria, it will pay council tax with the 100% second homes premium (200% total charge). This is much more expensive than business rates. [Full details on holiday lets and business rates](https://gloucester.gov.uk/council-tax/second-homes/holiday-lets.html) ## Exemptions from the second homes premium Some second homes may be exempt from the premium. Exemptions include: ### Job-related accommodation If your employer requires you to live in a property and you're liable for council tax on a second furnished home, you may get a 50% discount on the second home. ### Other exemptions Annexes, armed forces accommodation, and properties actively marketed for sale or let may qualify for exemptions. Full details of all exemptions available on the exemptions page. [Apply for an exemption](https://gloucester.gov.uk/council-tax/second-homes/exemptions.html) ## Who decides if a property pays business rates The Valuation Office Agency (VOA), not the council, decides whether a property pays council tax or business rates. If you think your holiday let should pay business rates instead of council tax, you need to contact the VOA with evidence that you meet the criteria. [Contact the Valuation Office Agency](https://www.gov.uk/contact-voa)"},{"url":"https://gloucester.gov.uk/council-tax/support.html","title":"Council Tax Support | Council Tax | Gloucester City Council","text":"Get help paying council tax if you're on a low income. ## What is Council Tax Support Council Tax Support is a benefit that helps people on low incomes pay their council tax bill. It can reduce your council tax by up to 100%, depending on your situation. This is a means-tested benefit, which means we look at your income, savings, and who lives with you when we work out how much help you can get. ## Apply for Council Tax Support You can apply online through your My Gloucester account. The application takes about 20 minutes to complete. [Apply online](https://gloucester-self.achieveservice.com/) ## Who can apply You can apply for Council Tax Support if: * You're on a low income or receive certain benefits * You pay council tax (as an owner or tenant) * Your savings are below £16,000 (if you're working age) * You live in Gloucester **You can still apply if:** * You're working (full time or part time) * You own your home * You're self-employed ## Different rules for different ages ### If you've reached State Pension age You may get more help if you or your partner have reached State Pension age (currently 66). There is no savings limit if you're pension age. ### If you're working age If you're under State Pension age, the amount of help you get depends on your income and savings. You cannot get Council Tax Support if your savings are over £16,000. ## How much help you can get The amount of Council Tax Support you get depends on: * Your income and savings * Who lives with you * Your circumstances (for example, if you have children or a disability) **Maximum support:** You can get up to 100% of your council tax paid if you're on certain benefits and have no other income. ## What you need to apply When you apply, you'll need to tell us about:\n\n### Your income * Wages or salary (yours and your partner's) * Benefits you receive * Pensions * Any other income ### Your savings * Money in bank accounts * Savings accounts * Investments ### Your household * Who lives with you * Your rent amount (if you rent) * Your council tax bill ## Tell us about changes You must tell us about any changes that might affect your Council Tax Support within 21 days. This includes: * Changes to your income * Starting or stopping work * Changes to benefits you receive * Someone moving in or out of your home * Changes to your savings Report changes through your My Gloucester account or call us on [01452 396396](tel:+441452396396). ## Proof we need You may need to send us proof of your income and circumstances. This could include: * Wage slips (last 3 months) * Bank statements (last 2 months) * Benefit letters * Rent agreement * Proof of identity We'll tell you what we need when you apply. You can upload documents through your My Gloucester account. ## How long it takes We aim to make a decision on your application within 4 weeks. We'll send you a letter telling you: * If you can get Council Tax Support * How much support you'll get * When it will start If we need more information from you, it may take longer."},{"url":"https://gloucester.gov.uk/council-tax/your-account.html","title":"View Your Council Tax Account | Council Tax | Gloucester City Council","text":"Sign in to view your bill, check payments, and manage your account. ## Sign in to your account Use My Gloucester to view your council tax bill, check payments, and update your details online. [Sign in to My Gloucester](https://gloucester-self.achieveservice.com/) ## What you can do online With your My Gloucester account, you can: * View your current council tax bill * Check your payment history * Set up or change a Direct Debit * Update your address when you move * Apply for discounts or exemptions * Sign up for paperless billing ## Register for an online account If you don't have a My Gloucester account yet, you can register online. You'll need: * ✓ Your council tax account reference number (on your bill) * ✓ Your postcode * ✓ An email address [Register for My Gloucester](https://gloucester-self.achieveservice.com/) ## Paperless billing Sign up for paperless billing to get your council tax bill by email instead of post. ### Benefits of paperless billing * Receive your bill faster * Never lose your bill * Better for the environment * Access your bills anytime online You can sign up for paperless billing through your My Gloucester account. ## Account security **Keep your account safe:** * Choose a strong password * Don't share your login details * Sign out when you're finished * Never click links in emails asking for your password If you think someone else has accessed your account, change your password immediately and contact us."},{"url":"https://gloucester.gov.uk/events/guildhall.html","title":"Guildhall Events | Gloucester City Council","text":"Hire the historic Gloucester Guildhall for your event, performance, or ceremony. ## About the Guildhall Gloucester Guildhall is a historic building in the heart of the city. It has performance and event spaces suitable for a range of activities. ## Suitable for ### Performances Concerts, shows, and theatre ### Conferences Business events and meetings ### Weddings Ceremonies and receptions ### Exhibitions Art and displays ### Ceremonies Civic and formal events ### Meetings Large group gatherings ## How to book 1. **Contact the Guildhall booking team** to check availability 2. **Complete booking form** with your event details 3. **Provide insurance** and risk assessment for your activities 4. **Get licensing if needed** for alcohol or entertainment 5. **Pay hire fees** before your event ## What you need Similar to other events on council property, you will need: * Insurance (public liability cover) * Risk assessment for your event activities * Licensing if selling alcohol or having entertainment (Temporary Event Notice or premises licence) * Compliance with capacity limits For availability, pricing, and bookings, contact the Guildhall booking team or the City Events team."},{"url":"https://gloucester.gov.uk/events/","title":"Events on Council Land | Gloucester City Council","text":"## About organising events You need permission from Gloucester City Council to hold events on council-owned land or property. This includes parks, open spaces, and council buildings. We help you plan safe events that work for everyone. Our team will guide you through what you need to do. ### Who can organise events Anyone can apply to organise an event, including: * Community groups and charities * Businesses and commercial organisers * Individuals planning celebrations ### How long it takes You must apply well in advance. The time needed depends on the size of your event: * **Small events** (up to 499 people) – apply at least 3 months before * **Medium events** (500-2999 people) – apply 3-6 months before * **Large events** (3000 or more people) – apply at least 6 months before * **Street parties** – apply 6-8 weeks before ## Popular venues * **Gloucester Park** Premier city park with 11 hectares of space * **Hillfield Gardens** Community park suitable for smaller events * **Barnwood Park & Arboretum** Green space with varied facilities * **Plock Court & Oxstalls Sports Park** Sports facilities and outdoor space * **Gloucester Guildhall** Historic building for performances and ceremonies **Check if your venue is available** Contact the City Events team at [city.events@gloucester.gov.uk](mailto:city.events@gloucester.gov.uk) or call [01452 396396](tel:+441452396396) ## What you need to provide All events need: * ✓ Event application form * ✓ Risk assessment * ✓ Site plan showing event layout * ✓ Public liability insurance (at least £5 million) * ✓ Temporary event notice if selling alcohol or having music"},{"url":"https://gloucester.gov.uk/events/parks-and-open-spaces.html","title":"Events in Parks and Open Spaces | Gloucester City Council","text":"Get permission to hold an event on council-owned parks, open spaces, and public land in Gloucester. ## What you get * ✓ Permission to use council land for your event * ✓ Advice and guidance from the City Events Manager * ✓ Assessment by the City Events Group * ✓ Help with licensing and permissions * ✓ Site inspection if needed * ✓ Emergency contact support on event day ## Types of events we support ### Community events Festivals, fetes, and celebrations ### Sports events Tournaments and competitions ### Charity events Fundraising and awareness events ### Cultural events Performances and shows ### Music events Concerts and outdoor music ### Markets and fairs Craft fairs and markets ## Available venues * **Gloucester Park** Premier city park with 11 hectares of space. Includes cricket club, bowling club, skate park, and bandstand * **Hillfield Gardens** Community park suitable for smaller events * **Barnwood Park & Arboretum** Green space with varied facilities * **Plock Court & Oxstalls Sports Park** Sports facilities and outdoor space * **City centre open spaces** Various locations in the city centre **Check venue availability** Contact the City Events team at [city.events@gloucester.gov.uk](mailto:city.events@gloucester.gov.uk) or call [01452 396396](tel:+441452396396)\n\n## How to apply 1. 1 **Contact the City Events team** Discuss your proposal and check venue availability 2. 2 **Complete Event Application Form** Fill in all details about your event 3. 3 **Prepare supporting documents** Risk assessment, site plan, and insurance certificate 4. 4 **Submit application** Email all documents to city.events@gloucester.gov.uk 5. 5 **Application reviewed** City Events Group will assess your application 6. 6 **Receive decision** We will tell you if your event is approved 7. 7 **Sign land use agreement** If approved, sign the agreement 8. 8 **Pay fees** Pay any fees and deposit before your event 9. 9 **Get licensing if needed** Apply for Temporary Event Notice if selling alcohol or having music 10. 10 **Pre-event site inspection** If needed, we will visit the site with you 11. 11 **Hold your event** Run your event safely 12. 12 **Clear the site** Remove all equipment and waste, return site to original condition 13. 13 **Post-event debrief** If needed, meet with us to discuss how it went ## How far in advance to apply ### Small events (up to 499 people) Events with up to 499 people and no amplified or live music Apply at least 3 months before your event ### Medium events (500-2999 people) Events with 500-2999 people or needing licensing Apply 3-6 months before your event ### Large events (3000+ people) Events with 3000 or more people Apply at least 6 months before your event ## What you need to provide\n\n### 1\\. Risk assessment You must assess all risks at your event. This includes: * Hazards during the event * Setup and takedown activities * Site-specific risks (slopes, water, roads nearby) * Weather risks * Crowd management * Emergency evacuation * Fire safety * Electrical safety * Food safety (if serving food) * First aid provision * Safeguarding (especially for children's events) * Accessibility ### 2\\. Site plan You must provide a plan showing: * Event layout and where activities will be * Stages, stalls, marquees, equipment * Emergency vehicle access points (at least 3 metres wide) * Entrances and exits for people * Emergency evacuation routes * First aid points * Fire safety equipment locations * Toilets (including accessible toilets) * Lost children point (if family event) * Alcohol sale areas (if selling alcohol) * Food vendor locations * Generator and power supply locations * Parking areas * Barriers and fencing ### 3\\. Insurance You must have: * **Public liability insurance** – at least £5 million cover. This protects against claims for injury, damage or loss to members of the public * **Employers liability insurance** – at least £5 million cover if you have paid staff or volunteers. This is a legal requirement ### 4\\. Licensing (if needed) #### Temporary Event Notice (TEN) You need a TEN if you are: * Selling or supplying alcohol * Having live music, recorded music, or performances * Serving hot food or drink between 11pm and 5am A TEN costs £21 and covers up to 499 people. Apply at least 10 working days before your event.\n\n#### Premises Licence You need a full premises licence if: * You have 500 or more people at any one time * Your event is longer than 7 days * You are having more than 15 events per year at the same location Allow at least 3 months to apply for a premises licence. #### Music licensing If you have live or recorded music, you may need a licence from PRS for Music. Call 0800 068 4828. ## Your responsibilities ### Before the event * Apply 3-6 months in advance * Complete event application form * Provide risk assessment * Provide site plan * Get insurance (at least £5 million public liability) * Apply for TEN or premises licence if needed * Contact PRS for Music if you have music * Tell local residents if your event will cause noise or disruption * Arrange staff and marshals * Book toilets, first aid, and waste collection * Arrange electricity if needed ### During the event * Supervise the event at all times * Keep emergency vehicle access clear (3 metres wide) * Manage crowds safely * Check site safety * Have emergency contact details available * Display your TEN if you have one * Make sure staff know emergency procedures ### After the event * Remove all equipment, structures and waste immediately * Return the site to how it was before * Tell us about any damage or incidents * Pay electricity costs if you used council electricity\n\n## Staffing and security **General rule** You should have at least 1 event staff member for every 100 people attending. For example, if you expect 475 people, you need at least 5 staff members. You will need: * Marshals at road closure points, emergency exits, and crowd control areas * Security for larger events or where alcohol is served * Staff who understand emergency procedures, evacuation routes, and first aid provision **Safeguarding:** All staff and volunteers working with children must have appropriate checks, including DBS checks where required. ## Facilities you must provide ### Toilets You must provide enough toilets based on how many people will attend and how long your event lasts. You must provide accessible toilets. General rule: 1 toilet for every 100-150 people. More if you are serving alcohol. ### First aid You must provide first aid based on your event size and risks: * Small events – first aid kit and trained first aider * Larger events – first aid point, multiple trained first aiders, consider St John Ambulance ### Waste management You must provide: * Enough bins * Litter collection during the event * Site clearance after the event * Separate waste streams for recycling if possible ### Electricity If you need electricity: * It must be installed by a qualified electrician * Check with City Events team if council electricity supply is available * If using generators, include them in your risk assessment and site plan * You will be charged for electricity usage after the event ## What is not allowed **These items are not permitted at events:** * Sky lanterns and balloon releases * Bonfires on parks or verges * Metal detecting without permission * Fireworks without specific approval * Animals for entertainment (performing animals, animals in costumes, animal rides) * Hazardous materials ## Who can apply Anyone can apply, including: * Individuals * Community groups * Charities * Commercial organisations\n\n### We cannot approve events that: * Are for political parties * Promote hatred or discrimination * Would cause unreasonable disruption * Cannot be made safe ## Costs There is a fee to use council land for events. The amount depends on: * Which venue or park you choose * How long your event lasts * What type of event (community or commercial) * How many people will attend * What facilities you need We may also ask for a damage deposit to protect against damage to the site. This will be refunded if you return the site in good condition. Payment is due before your event. ## Our service standards * We will reply to your first contact within 5 working days * We will decide on your application within 4 weeks of receiving all documents * Larger events may take longer if they need Safety Advisory Group approval * City Events Manager is available for advice before you apply * We will offer a site visit if needed * Emergency contact is available on event day"},{"url":"https://gloucester.gov.uk/events/privacy.html","title":"Privacy - Events on Council Land | Gloucester City Council","text":"How we use your personal information when you apply to organise events on council land or property. ## Who we are Gloucester City Council is the data controller for the personal information we collect when you apply to organise events on council land. **Data controller:** Gloucester City Council Eastgate Management Suite Eastgate Street Gloucester GL1 1PA ## What information we collect ### Venue availability queries When you ask about venue availability, we collect: * Email address * Event description * Preferred dates ### Event applications When you apply to organise an event, we collect: * Your name * Organisation name (if you represent an organisation) * Address * Email * Phone number * Event details (what, when, where, how many people) * Activities planned * Site plan * Risk assessment * Insurance certificate ### Safeguarding information For events involving children or vulnerable adults, we may ask for confirmation that staff have appropriate DBS checks. We do not ask for full DBS certificate details. ## Why we collect this information ### To provide advice on venue suitability and availability We need your contact details and event information to help you choose the right venue and check if it is available. ### To assess and approve event applications We need your event details, risk assessment, and insurance to make sure events can take place safely on council land. ### To coordinate with relevant teams We share your application with council teams (City Events Group) and sometimes with other agencies (Safety Advisory Group) to assess if your event can go ahead safely. ### To protect children and vulnerable adults We need to make sure appropriate safeguarding checks are in place for events involving children or vulnerable adults.\n\n## Legal basis for processing We process your information because it is part of our public task as a council. This means we have a duty to manage public land safely. **Legal basis under UK GDPR:** Article 6(1)(e) - public task For safeguarding information (if we receive it), we also use: **Legal basis under UK GDPR:** Article 9(2)(b) - necessary for safeguarding purposes ## Who we share your information with ### Within Gloucester City Council We share your application with the City Events Group. This includes teams responsible for: * Festivals and Events * Asset Management * Environmental Health * City Centre Management * Open Spaces * Licensing * Health and Safety ### Safety Advisory Group (for larger events) For larger events, we share your application with: * Gloucestershire County Council (Highways) * Gloucestershire Constabulary (Police) * Gloucestershire Fire and Rescue Service ### Licensing team If your event needs a Temporary Event Notice or premises licence, we may share relevant details with our Licensing team. ## How long we keep your information ### Email enquiries about venues Email correspondence is kept in line with our standard email retention policy. ### Event applications We keep event applications for a set period. This period is currently being confirmed. ## Your rights You have rights under data protection law: ### Right to be informed This notice tells you how we use your information. ### Right of access You can ask for a copy of the personal information we hold about you. ### Right to rectification You can ask us to correct information that is wrong. ### Right to erasure In some cases, you can ask us to delete your information. We cannot do this during application assessment or during required retention periods for approved events. ### Right to restrict processing In some cases, you can ask us to stop using your information temporarily. ### Rights that do not apply #### Right to data portability This only applies when processing is based on consent or contract. Event applications are public task processing, so this right does not apply.\n\n#### Right to object to processing This right does not apply to public task processing. We process event applications because it is our duty to manage public land safely. ## How to exercise your rights To exercise any of your rights, contact: We will respond within 1 month. ## Cookies If we introduce an online booking system, we will only use essential cookies to maintain your session during the application. We will not use analytics or marketing cookies. ## Complaints If you are unhappy with how we handle your information, you can complain to the Information Commissioner's Office (ICO). ## Updates to this notice We may update this privacy notice from time to time. Check this page for the latest information."},{"url":"https://gloucester.gov.uk/events/street-parties.html","title":"Street Parties and Road Closures | Gloucester City Council","text":"Get advice and support for organising a street party on a residential street in Gloucester. ## What is a street party A street party is a simple neighbourhood gathering where residents come together to celebrate on their own street. Typical street parties have: * Tables and chairs in the street * Less than 200 people * Only residents and invited guests * No ticket sales * No commercial stalls * No large structures like stages or marquees * Held in daylight hours * Finishes by 10pm ## Suitable streets ### Good for street parties * ✓ Quiet residential streets * ✓ Cul-de-sacs * ✓ Streets with low traffic ### Not suitable for street parties * A or B roads * Bus routes * One-way streets * Major through-routes * Streets where closure would cause significant traffic problems ## Road closure **Important** Road closures are processed by Gloucestershire County Council, not Gloucester City Council. Gloucester City Council can provide guidance, but you must apply to the County Council for the road closure. ### How long in advance to apply Apply for road closure at least 6-8 weeks before your street party. ### Road closure signs You must put up 'Road Closed' signs at both ends of your street. You can: * Borrow signs from the council (check availability) * Hire signs from sign companies * Buy signs from suppliers (around £50 each) * Make banners (must be clearly visible) ### Emergency vehicle access You must keep a clear path at least 3 metres wide for fire engines and ambulances to get through if needed. ## What you need to do\n\n### Before the street party * **Tell your neighbours** – Give written notice to all nearby residents about your plans. Tell them the date, time, and how long the road will be closed. Include your contact details for questions * **Apply for road closure** – Apply to Gloucestershire County Council at least 6-8 weeks before * **Get signs** – Arrange 'Road Closed' signs for both ends of the street * **Consider a Temporary Event Notice** – If you are selling or supplying alcohol, you need a TEN (£21) * **Consider insurance** – Public liability insurance is not legally required for simple street parties, but you may want to get it. If you do, get at least £5 million cover ### During the street party * **Display road closure notice** – Show the official notice from the County Council * **Put up signs** – Place 'Road Closed' signs at both ends of your street * **Put marshals at closure points** – Have people at both ends to guide traffic and help residents who need to drive in or out * **Keep emergency access clear** – Make sure emergency vehicles can get through (at least 3 metres wide) * **Allow resident access** – Let residents drive in slowly with a walking marshal if they need to ### After the street party * **Remove signs and decorations** – Take down all signs, barriers and decorations * **Clear all rubbish** – Clean up the street * **Reopen the road** – Make sure the road is clear for traffic again ## Alcohol and licensing ### If drinks are free You do not need a licence if drinks are genuinely free. ### If you are selling drinks or tickets include drinks You need a Temporary Event Notice (TEN) if: * You are selling alcoholic drinks * Tickets to your event include drinks A TEN costs £21 and must be applied for at least 10 working days before your event.\n\n### Music You usually do not need a licence for background music at a street party. If music is the main feature of your event, you may need a TEN or a licence from PRS for Music (call 0800 068 4828). ## Food You do not need to register for food hygiene for a one-off street party where residents are sharing food. You must make sure food is: * Prepared safely * Stored safely * Handled by people following basic hygiene practices ## Insurance Public liability insurance is not legally required for simple street parties. Low-risk street parties that are carefully planned have very little risk of liability claims. If you decide to get insurance, you should get at least £5 million cover. This may cost £50-100 depending on your event size. Neighbours can split the cost between households. ## Get help ### Gloucester City Council We can provide advice and guidance about street parties. * Email: [city.events@gloucester.gov.uk](mailto:city.events@gloucester.gov.uk) * Phone: [01452 396396](tel:+441452396396) ### Gloucestershire County Council For road closure applications, contact the County Council Highways team. Visit: [www.gloucestershire.gov.uk](https://www.gloucestershire.gov.uk/) ### Useful websites * [streetparty.org.uk](https://www.streetparty.org.uk/) – Street party guidance * GOV.UK – Your guide to organising a street party"},{"url":"https://gloucester.gov.uk/jobs/","title":"Jobs and Careers | Gloucester City Council","text":"## Why work for Gloucester City Council? At Gloucester City Council, you'll be part of a team dedicated to making a real difference to the lives of over 130,000 residents. Every role contributes to transforming our historic city into a thriving, sustainable community. ### Make an impact every day Whether you're collecting bins, supporting vulnerable families, shaping planning policy, or managing our parks, your work directly improves the quality of life in Gloucester. ## Benefits of working with us 💰 ### Competitive pay and pension Salaries aligned to the Local Government pay scale, plus access to the excellent Local Government Pension Scheme with generous employer contributions. 🏠 ### Flexible working Work-life balance matters. Many roles offer flexible hours, hybrid working, and part-time options to fit around your life. 📚 ### Learning and development Access professional training, apprenticeships, mentoring, and development programmes to help you grow your career. 🌴 ### Generous holiday Minimum 25 days annual leave (rising with service) plus bank holidays, with options to buy or sell additional days. ❤️ ### Health and wellbeing Employee Assistance Programme, occupational health support, wellbeing initiatives, and discounted gym memberships. 🤝 ### Inclusive workplace We're committed to diversity and inclusion. We welcome applications from all backgrounds and provide support for employees with disabilities. ## Working at Gloucester City Council We're a forward-thinking council serving a vibrant, historic city. Our vision is a Gloucester that works for everyone — inclusive, thriving, and future-ready. We're investing in regeneration, tackling climate change, and supporting our most vulnerable residents.\n\n### Our values * ✓ **Delivering value in a green, sustainable way** We use resources wisely and protect Gloucester for the future. * ✓ **Working with others to make residents’ lives better** We work together with partners to deliver better outcomes for residents. * ✓ **Treating all people with fairness, compassion and respect** We listen, we care, and we treat people with dignity. * ✓ **Being forward thinking with innovation** We welcome ideas and keep improving how we deliver services. * ✓ **Being passionate about the city** We’re proud of Gloucester and committed to helping it thrive. ## Career areas We offer over 800 different types of roles across a wide range of services: **Environmental Services** Waste collection, street cleansing, parks and green spaces **Planning and Development** Planning, building control, regeneration, economic growth **Housing and Communities** Housing, homelessness, community development, grants **Corporate Services** HR, finance, IT, customer services, legal, communications **Regulatory Services** Licensing, environmental health, community safety **Culture and Leisure** Museums, tourism, events, sports facilities ## Ready to join our team? Browse our current vacancies and take the first step towards a rewarding career with Gloucester City Council. [View current vacancies](https://gloucester.gov.uk/jobs/current-vacancies.html) ## Application support If you need help with your application or have questions about working for us: * Email: [recruitment@gloucester.gov.uk](mailto:recruitment@gloucester.gov.uk) * Phone: [01452 396396](tel:+441452396396) * Visit: Eastgate Management Suite, Eastgate Street, Gloucester GL1 1PA **Accessibility and inclusion:** We're committed to being an inclusive employer. If you need any adjustments during the recruitment process, please let us know and we'll do our best to accommodate your needs."},{"url":"https://gloucester.gov.uk/your-council/","title":"Your Council | Gloucester City Council","text":"## Explore our council Everything you need to know about how Gloucester City Council works, from finding your councillor to watching our meetings and understanding our plans for the city. ## How We're Organised Learn about our leadership structure including the Mayor and Sheriff (ancient civic roles dating back over 800 years), how decisions are made, and how the council operates ## Councillors and Wards Find your local councillor, view ward maps, and learn about councillor standards and allowances ## Meetings and Decisions View meeting dates, watch webcasts, read agendas and minutes, and find out how to have your say ## Elections and Voting Register to vote, find your polling station, and learn about elections in Gloucester ## Transparency and Data Access spending data, contracts, senior salaries, and other transparency information ## Our Plans and Policies Read our council plan, strategies, and key policies that guide our work ## Contact and Complaints Get in touch with the council, make a complaint, or provide feedback ## Partnerships Learn about our partnerships with other organisations and how we work together"},{"url":"https://gloucester.gov.uk/council-tax/discounts/students.html","title":"Students and Council Tax | Discounts and Exemptions | Council Tax | Gloucester City Council","text":"Find out if you are exempt from council tax as a student and how to apply for a student exemption. ## Full-time students Full-time students do not have to pay council tax. This is a full exemption, not a discount. **Key point:** If everyone in your property is a full-time student, no one has to pay council tax. The property is exempt. ## Who qualifies as a full-time student You are a full-time student for council tax purposes if your course meets these conditions: ### Course duration Your course must last at least 1 academic year (or 1 calendar year if it is not based on academic years). ### Study hours You must study for at least 21 hours per week during term time. This includes lectures, tutorials, practical work, and supervised study. ### Recognised institution Your course must be at a recognised educational establishment, such as a university or college. **This includes:** * University undergraduate and postgraduate courses * Higher education courses at colleges * Some vocational courses (if they meet the 21 hours per week rule) ## If you live with non-students If you are a full-time student but live with people who are not students, the rules are different: ### One student, one non-student The non-student has to pay council tax. However, because only one adult counts (the student does not count), the non-student can get a 25% single person discount. **Example:** You are a student and live with your partner who works. Your partner pays council tax but gets 25% off because you do not count as an adult for council tax purposes. ### Multiple students with one non-student If several students live with one non-student, the non-student has to pay the full council tax bill (no discount). **Example:** Three students and one working person share a house. The working person pays the full council tax. The students do not pay anything. ### Two or more non-students If two or more non-students live in the property, they share the full council tax bill. Students living there do not pay anything and do not reduce the bill.\n\n## Student nurses and midwives Student nurses and student midwives are exempt from council tax if they are on a course leading to registration with a nursing or midwifery council. This includes students on: * Nursing degree courses * Midwifery degree courses * Courses leading to Nursing and Midwifery Council (NMC) registration ## Apprentices and trainees Apprentices under 20 years old do not count for council tax purposes. This means: * If you live alone and are an apprentice under 20, you do not pay council tax * If you live with one other adult and are an apprentice under 20, they can get 25% single person discount **Note:** This only applies to certain apprenticeships. The apprenticeship must be registered with the government and include training for a recognised qualification. If you are not sure, contact us. ## Part-time students Part-time students usually have to pay council tax. You are not exempt just because you are studying. However, you may be able to get help in other ways: * **Council Tax Support:** If you are on a low income, you may qualify for Council Tax Support to help pay your bill. See our [Council Tax Support page](https://gloucester.gov.uk/council-tax/support.html). * **Single person discount:** If you live alone, you can get 25% off your council tax. ## Proof you need to provide To claim a student exemption or discount, you need to give us a student certificate from your university or college. ### What is a student certificate? A student certificate (sometimes called a council tax exemption certificate) is a letter from your university or college that confirms: * You are enrolled on a course * The course start and end dates * The course is full-time (at least 21 hours per week) * The course lasts at least 1 year\n\n### How to get a student certificate Most universities and colleges allow you to download a student certificate from your student portal or online account. Look for: * Council tax exemption certificate * Council tax certificate * Student status letter If you cannot find it online, contact your university or college student services team. **Important:** We need a certificate for each full-time student in the property. A student ID card is not enough. We need an official letter or certificate from your university or college. ## During summer holidays Your student exemption continues during the summer holidays if: * You are still enrolled on your course * You will be returning to study in the next academic year * Your course has not finished **What if I finish my course?** Your exemption ends on the last day of your course (not your final exam). After that, you have to pay council tax unless you start another full-time course. ## When students have to pay council tax Even if you are a full-time student, you may have to pay council tax if: * You own the property and rent it out to non-students * You are a foreign language assistant working in the UK * Your course is not at least 21 hours per week * Your course does not last at least 1 year ## Apply for student exemption Apply online through your My Gloucester account. You will need to upload your student certificate. [Apply now](https://gloucester-self.achieveservice.com/) ## Tell us if your circumstances change You must tell us if: * You finish your course * You leave your course * You switch to part-time study * Someone moves in or out of your property * A student in your property stops being a student If you do not tell us, you may have to pay back council tax you did not pay, plus a penalty."},{"url":"https://gloucester.gov.uk/council-tax/second-homes/exemptions.html","title":"Second Home Premium Exemptions | Council Tax | Gloucester City Council","text":"Apply for an exemption from the second homes premium. ## About the second homes premium **From 1 April 2025, most second homes pay a 100% premium on top of the standard council tax charge (200% total).** However, some second homes may be exempt from the premium. This page explains what exemptions are available and how to apply. ## Mandatory exemptions (set by law) The following exemptions are set by law. If your property qualifies, you will automatically be exempt from the second homes premium. ### Job-related accommodation If your employer requires you to live in a property and you're liable for council tax on a second furnished home, you may get a 50% discount on the second home. **You must provide:** * A letter from your employer confirming the job-related accommodation requirement * Your employment contract showing the accommodation requirement * Proof that you're liable for council tax on both properties ### Annexes Annexes that are part of, or within the grounds of, a single main home may be exempt from the premium. **The annex must:** * Be part of a single property or within the grounds * Not be anyone's sole or main residence * Be used by the household (for example, for guests or family members) **Note:** If the annex is let out commercially or used as a separate business, it may not qualify for this exemption. ### Armed forces accommodation Properties owned by serving armed forces personnel who are required to live in military accommodation may be exempt from the premium. **You must provide:** * Proof of service in the armed forces * Evidence that you're required to live in military accommodation * Confirmation that the property is not let out commercially ## Local discretionary exemptions Gloucester City Council has also introduced local exemptions in specific circumstances.\n\n### Properties actively marketed for sale or let If your second home is being actively marketed for sale or to let, you may be exempt from the premium for up to 12 months. **You must show that you are:** * Actively marketing the property at a reasonable market price * Using an estate agent or online listing service * Making genuine efforts to sell or let the property * Accepting reasonable offers **Evidence required:** * Estate agent or letting agent contract * Property listing screenshots showing the property is advertised * Evidence of marketing activity (viewings, offers received) * Valuation showing the asking price is at market rate **12-month limit:** This exemption is granted for up to 12 months. If the property has not sold or let after 12 months, the premium will apply unless you can show exceptional circumstances. ### Properties undergoing major renovation Properties that are genuinely uninhabitable due to major renovation or structural work may be exempt from the premium during the work period. **The work must:** * Make the property genuinely uninhabitable * Be major structural work (not just redecoration) * Be actively in progress * Have appropriate planning permission or building regulations approval if required **Evidence required:** * Building contractor invoices * Photos showing the extent of work * Planning permission or building regulations certificates (if applicable) * Projected completion date ### Properties in probate If a property is empty due to the recent death of the owner and probate is being processed, it may be exempt from the premium during the probate period. **You must provide:** * Death certificate * Probate application documentation * Evidence that probate is in progress **Note:** Once probate is granted and ownership transfers, normal council tax rules apply.\n\n## What doesn't qualify for an exemption The following situations do not qualify for an exemption from the second homes premium: * Properties that are simply empty and not being marketed for sale or let * Properties used occasionally for holidays or weekends (unless they qualify as a genuine holiday let paying business rates) * Properties let to friends or family at below market rates * Properties marketed at an unrealistic price to avoid selling * Investment properties held for capital appreciation * Properties that could be lived in but the owner chooses not to ## How to apply for an exemption To apply for an exemption from the second homes premium: 1. **Check you qualify** - Make sure your property meets one of the exemption criteria above 2. **Gather evidence** - Collect all the documents listed for your exemption type 3. **Apply online** - Use your My Gloucester account to submit your application 4. **Wait for a decision** - We'll review your application and contact you within 28 days [Apply for an exemption](https://gloucester-self.achieveservice.com/) You'll need your council tax account reference number. ## What evidence you need to provide All applications must be supported by documentary evidence. The type of evidence depends on which exemption you're applying for. ### General evidence requirements * Documents must be official and dated * We may verify information with third parties (estate agents, employers, etc.) * You may be required to provide updated evidence periodically * False information may result in prosecution and withdrawal of the exemption ### Evidence for the 12-month marketing exemption For the actively marketed exemption, you must provide: * **Estate agent contract** showing the property is listed for sale or let * **Property listing screenshots** from Rightmove, Zoopla, or other platforms * **Independent valuation** showing your asking price is at market rate * **Marketing activity log** (viewings, offers, enquiries) We will check that the property is genuinely available and that the price is realistic. Properties marketed at significantly above market value to avoid selling will not qualify. ## Review and appeals\n\n### If your application is approved If we approve your exemption, we'll write to confirm: * The start date of the exemption * How long the exemption will last * What you need to do to maintain the exemption * When you need to provide updated evidence ### If your application is refused If we refuse your exemption application, we'll explain why. You can: * Ask us to review the decision if you have new evidence * Contact us to discuss your circumstances * Appeal to the Valuation Tribunal if you believe the decision is wrong ## Your ongoing obligations If your exemption is approved, you must: * **Tell us about changes** - Inform us if your circumstances change (for example, if you stop marketing the property) * **Provide updates** - Give us updated evidence when we ask for it * **Maintain the qualifying criteria** - Continue to meet the exemption requirements * **Renew if required** - Some exemptions need to be renewed annually **Warning:** If you fail to notify us of changes or provide false information, we may withdraw the exemption and charge you backdated council tax plus the premium. We may also prosecute for fraud."},{"url":"https://gloucester.gov.uk/council-tax/second-homes/holiday-lets.html","title":"Holiday Lets and Business Rates | Council Tax | Gloucester City Council","text":"When holiday lets pay business rates instead of council tax. **Holiday lets and self-catering accommodation occupy a unique position in the tax system.** They can be liable for either council tax OR business rates, depending on how much they are let out. The key difference is: * **Business rates:** If the property meets strict letting criteria (140/70 days) * **Council tax with second homes premium:** If the property does not meet the criteria (200% of standard charge from April 2025) ## The 140/70 day criteria To pay business rates instead of council tax, your holiday let must meet **ALL** of these criteria: ### All 4 criteria must be met #### 1\\. Available for at least 140 days The property must be **available to let** commercially for short periods totalling at least 140 days in: * The previous 12 months, AND * The current 12 months (or you intend to make it available) **Note:** This is about availability, not actual bookings. The property must be genuinely advertised and available at market rates. #### 2\\. Actually let for at least 70 days The property must be **actually let** commercially for at least 70 days in the previous 12 months. **Important:** Your own use does not count. This must be paying guests on short-term lets at market rates. #### 3\\. Commercial basis The property must be let on a **commercial basis** with a view to making a profit at market rates. This means genuine commercial letting, not occasional use by friends and family at low rates. #### 4\\. Future intention You must **intend** to make the property available for at least 140 days in the following 12 months. This must be a genuine intention, evidenced by continued advertising and availability. ### What counts as a 'short period'? A short period means **stays of less than 140 consecutive days** by the same person or group. If you let to the same person for 140 days or more, it may be treated as a long-term let and subject to council tax, not business rates.\n\n## Who decides: The Valuation Office Agency (VOA) **The Valuation Office Agency (VOA), not the council, decides whether a property pays council tax or business rates.** ### How the VOA makes decisions The VOA will look at: * Your letting records (bookings, income) * Advertising and availability evidence * Your business plan and intentions * Whether the property is genuinely run as a commercial business * Market rates for similar properties in the area ## Council tax vs business rates: what's the difference? ### Business rates (if you meet the criteria) * **Small business rate relief:** Properties with a rateable value under £12,000 may pay no business rates at all * **Properties between £12,000 and £15,000:** May get partial relief * **No second homes premium** * **Treated as a business:** Can claim business expenses for tax purposes ### Council tax (if you don't meet the criteria) * **Standard council tax charge PLUS 100% second homes premium from April 2025** * This means **200% of the normal council tax** (double) * Significantly more expensive than business rates for most properties * Cannot claim business rate relief **Example:** A Band D property normally pays £2,238.77 per year. With the second homes premium, it will pay £4,477.54 per year from April 2025. ## Small business rate relief for holiday lets If your holiday let qualifies for business rates, you may also qualify for small business rate relief. ### Eligibility for small business rate relief * **Rateable value under £12,000:** 100% relief (pay nothing) * **Rateable value between £12,000 and £15,000:** Tapered relief (partial) * **Rateable value over £15,000:** No relief, pay full business rates Most small holiday cottages and flats have rateable values under £12,000, meaning they could pay no business rates at all.\n\n### How to apply for small business rate relief If your property is on the business rates list and has a rateable value under £15,000, you can apply for small business rate relief. Contact our Business Rates team: * Phone: [01452 396396](tel:+441452396396) * Email: [revenues@gloucester.gov.uk](mailto:revenues@gloucester.gov.uk) ## What happens if you don't meet the criteria? **If your holiday let does not meet the 140/70 day criteria, it will be liable for council tax, not business rates.** From 1 April 2025, this means you will pay: * The standard council tax for your property's band * **PLUS a 100% second homes premium** * **Total: 200% of the standard council tax charge** **Action required:** If you're currently paying business rates but won't meet the 140/70 criteria, you need to contact the VOA to have your property reassessed. Otherwise you may be liable for backdated council tax. ## Evidence to keep To prove your holiday let meets the criteria, you should keep detailed records: ### Availability evidence (140 days) * Calendar showing when the property was available to book * Screenshots of listings on Airbnb, Booking.com, etc. * Website availability calendar * Booking agent contracts and statements ### Actual letting evidence (70 days) * Booking records with dates and guest names * Income records (bank statements, booking platform reports) * Guest feedback and reviews * Cleaning and changeover records ### Commercial basis evidence * Pricing comparable to market rates * Business plan or marketing strategy * Advertising spend and marketing materials * Terms and conditions for bookings ### Future intention evidence * Forward bookings * Continuing advertising and promotion * Investment in the property or marketing * Business planning documents **Keep these records for at least 3 years.** The VOA may ask to see them at any time to verify your property still qualifies for business rates. ## Common scenarios\n\n### Scenario 1: New holiday let business **Question:** I've just converted my property to a holiday let. Can I pay business rates straight away? **Answer:** For the first year, you need to show you _intend_ to meet the 140/70 criteria. This means: * Have a business plan showing you expect to let for 70+ days * Actively advertise the property for at least 140 days * Set prices at market rates In the second year, the VOA will check you actually achieved 70 days of letting. If you didn't, you may be moved back to council tax. ### Scenario 2: Below 70 days actual letting **Question:** My property was available for 140 days but only let for 50 days. What happens? **Answer:** You don't meet the criteria. Your property will be liable for council tax with the second homes premium (200% of standard charge) from April 2025. You should contact the VOA to have your property reassessed and removed from the business rates list. ### Scenario 3: Personal use and family stays **Question:** I let my property for 80 days but also use it myself for 30 days. Does it qualify? **Answer:** Yes. The 70 days must be commercial lets at market rates. Your personal use doesn't count towards the 70 days, but it doesn't disqualify you either. As long as you had 70 days of paying guests, you meet the criteria. **However:** Letting to family and friends at low rates does NOT count towards the 70 days. It must be commercial letting at market rates.\n\n### Scenario 4: Seasonal holiday let **Question:** My cottage is only available in summer (June to September). Can it still qualify? **Answer:** Possibly, but it's challenging. You need to show: * The property was available for at least 140 days during that season * It was actually let for at least 70 days * There's a genuine reason it can't be let year-round (for example, access issues in winter) If you simply choose not to let it outside summer, it may not meet the \"commercial basis\" test and could be liable for council tax. ## The council's role Gloucester City Council does not decide whether your property pays council tax or business rates. This is the VOA's decision. **What we do:** * Issue council tax bills for properties the VOA says should pay council tax * Issue business rates bills for properties the VOA says should pay business rates * Administer small business rate relief for eligible properties * Collect payment of council tax or business rates **What we cannot do:** * Decide whether your property qualifies for business rates * Override VOA decisions * Exempt you from the second homes premium if the VOA says you should pay council tax **If you disagree with your classification,** you must contact the VOA, not the council. We will follow the VOA's decision. For all questions about whether your property should pay council tax or business rates: * **To apply for business rates:** Contact the VOA with evidence you meet the criteria * **To challenge a decision:** Contact the VOA with new evidence * **To check your rateable value:** Use the VOA website [Visit the VOA website](https://www.gov.uk/contact-voa) The VOA can take several weeks to assess your property. Make sure you keep detailed records of your letting activity."},{"url":"https://gloucester.gov.uk/council-tax/support/eligibility.html","title":"Eligibility for Council Tax Support | Council Tax Support | Council Tax | Gloucester City Council","text":"Find out if you qualify for Council Tax Support and how we work out how much help you can get. ## Basic eligibility rules To qualify for Council Tax Support, you must meet all of these basic rules: * You are liable to pay council tax (as an owner or tenant) * You live in the property as your main home * The property is in Gloucester * You are on a low income or receive certain benefits **Good news:** You can still apply if you are working, own your home, or are self-employed. Council Tax Support is not just for people who are unemployed. ## Income and savings limits ### If you are working age (under State Pension age) If you are under State Pension age (currently 66), these limits apply: **Savings limit: £16,000** You cannot get Council Tax Support if your savings and capital are over £16,000. This includes: * Money in bank accounts and savings accounts * Premium bonds and investments * Property you own (but not your main home) * Value of vehicles (except one car for personal use) **Savings between £6,000 and £16,000** If you have savings between £6,000 and £16,000, we treat every £250 (or part of £250) over £6,000 as income of £1 per week. **Example:** If you have £8,000 in savings, we treat this as £8 per week income (£2,000 ÷ £250 = 8). ### If you are pension age (State Pension age or over) If you or your partner have reached State Pension age (currently 66), different rules apply: **Savings limit: £10,000** We treat savings between £10,000 and any amount as income at £1 per week for every £500 (or part of £500) over £10,000. **Important:** There is no upper savings limit if you are pension age. You can still get Council Tax Support even if you have savings over £16,000.\n\n## How we work out your support We look at several factors when we work out if you qualify and how much support you can get. ### Your income We count most types of income, including: #### Earnings from work * Wages and salary (after tax and National Insurance) * Self-employed profits * Bonuses and overtime **Note:** We ignore some of your earnings to encourage working. If you are working age, we ignore £25 per week (or more in some cases). #### Benefits and pensions * State Pension * Private or workplace pensions * Universal Credit * Employment and Support Allowance (ESA) * Jobseeker's Allowance (JSA) * Pension Credit **Note:** Some benefits are ignored, including Disability Living Allowance, Personal Independence Payment, and Child Benefit. #### Other income * Income from boarders or lodgers * Maintenance payments * Rental income from property you own * Income from savings and investments ### Your household Who lives with you affects how much support you can get. We consider: * **Your partner:** If you live with a partner (married, civil partner, or living together as a couple), we count their income and savings too * **Children:** Dependent children increase the amount of income you can have and still get support * **Non-dependants:** Adults who live with you (like grown-up children or relatives) may reduce your support, as we expect them to contribute to household costs * **Carers:** If someone looks after you or your partner, this may increase your support **Non-dependant deductions:** If you have adult children or other adults living with you who are working, we reduce your support by a set amount each week. This is because we expect them to contribute to household costs. You must tell us if anyone moves in or out.\n\n### Your circumstances Certain circumstances can increase your support. You may get more help if: * You or your partner are disabled * You or your partner are a carer * You have dependent children * You are a single parent * You or your partner are severely sight impaired (blind) * You have reached State Pension age ## Maximum support - passported benefits You may get maximum Council Tax Support (up to 100% of your bill paid) if you receive: * Income Support * Income-based Jobseeker's Allowance * Income-related Employment and Support Allowance * Pension Credit (Guarantee Credit) If you receive Universal Credit, the amount of support depends on your income and circumstances. ## Who cannot get Council Tax Support You cannot get Council Tax Support if: * You have savings over £16,000 (if you are working age) * You are a full-time student (unless you are disabled, have children, or are a single parent) * You are subject to immigration control and have no recourse to public funds * You live in a care home and the council pays for your care * Your income is high enough that your calculated support is less than 50p per week **Students:** Full-time students normally cannot get Council Tax Support. However, you may qualify if you are a single parent, disabled, or have a disabled partner. See our [students page](https://gloucester.gov.uk/council-tax/discounts/students.html) for more information about student exemptions. If you think you might qualify, apply online. We will check your eligibility and let you know how much support you can get. [Apply now](https://gloucester-self.achieveservice.com/)"},{"url":"https://gloucester.gov.uk/your-council/how-were-organised/leadership-and-structure.html","title":"Leadership and Structure | Your Council | Gloucester City Council","text":"Gloucester City Council is led by elected councillors and supported by professional officers who work together to deliver services and make decisions that affect our city. ## At a glance 39 Councillors 16 Wards 10 Cabinet Members ## Civic Leadership ### Ancient offices dating back over 800 years The Mayor and Sheriff are ceremonial roles with deep historical roots. The Sheriff was established by King John's Charter in 1200, making it nearly 500 years older than the City Council itself. The first recorded Mayor was Richard the Burgess in 1228. #### 👑 The Mayor (545th) **First citizen of the city** - Chairs Full Council meetings and represents Gloucester at civic, ceremonial and community events. Appointed annually by councillors, the Mayor is a non-political role focused on civic duties. _Current: Councillor Ashley Bowkett (2025)_ #### 🛡️ The Sheriff (895th) **Deputy Mayor and historic office** - Vice-chairs Full Council and accompanies the Mayor on formal occasions. Originally collected taxes and presided over courts; now a ceremonial role preserving 825 years of Gloucester's history. _Current: Councillor Linda Castle (2025)_ **💡 Did you know?** Gloucester is one of only 15 UK towns and cities that have retained the ancient office of Sheriff, alongside York, Oxford, Canterbury, and Nottingham. ## Political Leadership ### Elected by residents The council is made up of 39 elected councillors who represent the city's 16 wards. Councillors are elected every four years to make decisions on behalf of residents and champion local issues. #### 🏛️ The Leader The Leader is elected by councillors and is responsible for the council's overall direction and leadership. The Leader appoints the Cabinet and represents the council publicly. #### 👥 The Cabinet The Cabinet is made up of up to 10 councillors, each with responsibility for specific areas like housing, environment, or finance. They make most major decisions. #### 🗳️ Full Council All 39 councillors meet regularly as Full Council to make key decisions including setting the budget, agreeing major policies, and appointing committees.\n\n#### 🔍 Overview & Scrutiny Scrutiny councillors hold the Cabinet to account, review decisions, and investigate issues that matter to residents. [View Leader and Cabinet](https://gloucester.gov.uk/your-council/councillors-and-wards/leader-and-cabinet.html) [Find your councillor](https://gloucester.gov.uk/about/councillors.html) ## Officer Structure The council employs around 400 professional officers to deliver services and provide advice to councillors. Officers implement the decisions made by councillors and ensure services run smoothly. #### Chief Executive The Chief Executive is the head of paid service and leads all council officers. They ensure the council operates effectively and delivers on its priorities. #### Corporate Management Team Senior directors responsible for different service areas such as communities, place, and resources. They manage teams and budgets. #### Service Managers Managers lead specific services like planning, housing, environmental services, and customer services. [View senior officer pay](https://gloucester.gov.uk/your-council/how-were-organised/senior-pay-and-staffing.html) ## How Decisions Are Made The council makes decisions through various meetings and committees: * **Cabinet** - Makes most major decisions on services and policies * **Full Council** - Sets the budget and agrees the policy framework * **Planning Committee** - Decides planning applications * **Licensing Committee** - Makes decisions on licences for taxis, alcohol, and entertainment * **Overview & Scrutiny** - Reviews and challenges Cabinet decisions * **Audit & Governance** - Ensures financial controls and good governance\n\n### Public participation Most council meetings are open to the public. You can attend in person, watch online, or even speak at certain meetings to share your views. [Learn how to have your say →](https://gloucester.gov.uk/your-council/meetings-and-decisions/have-your-say) [View meeting calendar](https://gloucester.gov.uk/your-council/meetings-and-decisions/calendar.html) [Read our constitution](https://gloucester.gov.uk/your-council/how-were-organised/our-constitution.html)"},{"url":"https://gloucester.gov.uk/your-council/meetings-and-decisions/calendar.html","title":"Meeting Calendar | Your Council | Gloucester City Council","text":"## View upcoming council meetings All council meetings are open to the public unless stated otherwise. You can attend in person, watch online, or view agendas and minutes. ### Full meeting calendar For the full interactive calendar with all meetings, agendas, and minutes, visit our democracy pages: [View full calendar on democracy.gloucester.gov.uk](https://democracy.gloucester.gov.uk/) ### Key Meeting Types #### Full Council All 39 councillors meet to make key decisions including setting the budget and agreeing major policies. **Frequency:** Usually monthly **Time:** Typically 6:00pm #### Cabinet The Cabinet makes most of the council's major decisions on services and policy. **Frequency:** Usually monthly **Time:** Typically 6:00pm #### Planning Committee Decides on planning applications that can't be decided by officers. **Frequency:** Usually fortnightly **Time:** Typically 6:00pm #### Overview and Scrutiny Committee Holds the Cabinet to account and reviews council policies and decisions. **Frequency:** Usually monthly **Time:** Typically 6:00pm ### Attending Meetings * **In person:** Most meetings are held at the Eastgate Management Suite, Eastgate Street, Gloucester GL1 1PA * **Online:** Watch live meetings on [our YouTube channel](https://youtube.com/@GloucesterCityCouncil) * **Speak at a meeting:** [Learn how to have your say](https://gloucester.gov.uk/your-council/meetings-and-decisions/have-your-say/speak-at-a-meeting.html) ### Agendas and Minutes All meeting agendas are published at least 5 working days before the meeting. Minutes are published after the meeting. [Search agendas and minutes](https://gloucester.gov.uk/your-council/meetings-and-decisions/agendas-minutes.html)"}]